<template>
  <div id="about_view">
    <h1>درباره پروژه</h1>
    <h2>ترموستاد چیکار میکنه؟</h2>
    <p>ترموستاد یک اپلیکیشن تحت وب برای بازبینی دروس ارائه شده هر ترم دانشگاه تهران بر اساس رشته تحصیلی شماست.
      از ترموستاد میشه برای برنامه ریزی ترم آینده و انتخاب و بررسی واحد ها قبل از تایم اصلی انتخاب واحد استفاده کرد.
      پیدا کردن تداخل های زمانی داخل روز های ارائه درس و تایم های امتحان و سبک سنگین کردن برنامه هفتگی همیشه از مشکلات دانشجو ها در موقع انتخاب واحد بوده.
      ترموستاد به وجود اومده تا این کار ها رو براتون آسون تر کنه.
    </p>
    <h2>ترموستاد چطور ساخته شده؟</h2>
    <p>
      ایده اولیه این پروژه از طرف دوست خوبم میلاد و با الهام گیری از <a href="#">ترمیناتور شریف</a> اومد.
      <br>
      نسخه اولیه و آزمایشی/بتا در ظرف چند روز آمده شده و در تابستان هزار و چهارصد برای ترم پاییز توسط دوستان نزدیک تست شد.
      برای ترم زمستان هزار و چهارصد پروژه بطور کلی بازنویسی شد و بصورت اوپن سورس در دسترس قرار میگیره. در نسخه جدید قابلیت های جدید اضافه شده، خیلی مشکلات رفع شده. کد بهینه تر و سریع تری داریم. امکان مشارکت سایر رشته ها اضافه شده
      و اینکه کد قابلیت خوندن و توسعه رو داره.
          <img src="../assets/PoweredByVue.png" alt="قدرت گرفته از Vue.js">
      ترموستاد در هر دو نسخه موجود از فریم ورک فوق العاده Vue.js استفاده میکنه.
      ویو باعث شده که توسعه و بروزرسانی خیلی خیلی سریع برای من که خودم دانشجو هستم ممکن باشه.
      اکثر کار رو ویو انجام میده و من صرفا یه پیاده سازی خیلی ساده انجام دادم. در ورژن جدید از Vue-Cli برای پیاده سازی استفاده کردم که خب قطعا نظم خیلی خیلی بیشتری به پروژه میده.
    </p>
    <h2>کیا به توسعه کمک کردن؟</h2>
    <p>در لیست زیر کسایی که به پروژه کمک کردن/می کنند رو به همراه رشته تحصیلی شون میبینید. این کمک میتونه با ویرایش/بهبود کد بوده باشه
      یا اینکه با دیتا آماده کردن برای رشته خودشون.
      <br>
      اگر اسم رشتتون رو نمی بینید و فکر میکنید بتونید از گلستان یک جدول HTML از گزارش درس های ترم بعدی استخراج کنید به من ایمیل بدید که 
      با کمک شما رشته شما هم به پروژه اضافه بشه و اسمتون در لیست زیر هم بیاد:
    </p>
  </div>
</template>
<style>
  #about_view {
    max-width: 1000px;
    margin: auto;
    min-height:700px;
    padding:20px 40px;
  }
  #about_view p {
    line-height: 28px;
    margin:5px 0;
    color:rgb(14, 36, 70);
    font-size:14px;
  }
  #about_view .quote{
    padding-right: 10px;
    border-right: 2px solid;
  }
  #about_view h1 {
    font-weight: 100;
    margin-bottom: 20px;
    display: block;
    text-align: center;
    font-size:20px;
    color: rgb(57, 77, 104);
  }
  #about_view h2 {
    color: rgb(6, 182, 123);
    font-size: 16px;
    display:block;
    margin:6px 0;
  }
  #about_view img {
    display: block;
    margin:auto;
    width: 350px;
  }
  .night_mode_on #about_view h1 {
    color:#fff !important;
  }
  .night_mode_on #about_view p {
    color:rgba(255, 255, 255,0.67) !important;
  }
</style>
